### ETL

In [68]:
import pyodbc
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.engine import URL

In [70]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server',
 'ODBC Driver 18 for SQL Server']

In [71]:
import config

In [74]:
user= config.user
pwd= config.password

In [78]:
connection_string= ("Driver= {ODBC Driver 17 for SQL Server};"
                    "Server= DESKTOP-LHM7NSV\\SQLEXPRESS;"
                    "Database=AdventureWorks2022;"
                    f"UID={user};"
                    f"PWD={pwd};"
                    "Trusted_Connection=yes;")

In [79]:
connection_URL= URL.create("mssql+pyodbc", query= {"odbc_connect": connection_string})
src_engine= create_engine(connection_URL)
src_conn= src_engine.connect()

In [80]:
query= "SELECT * FROM Sales.Customer"
sales_df= pd.read_sql(query, src_conn)

In [81]:
sales_df

,CustomerID,PersonID,StoreID,TerritoryID,AccountNumber,rowguid,ModifiedDate
0,1,NaN,934.0,1,AW00000001,3F5AE95E-B87D-4AED-95B4-C3797AFCB74F,2014-09-12 11:15:07.263
1,2,NaN,1028.0,1,AW00000002,E552F657-A9AF-4A7D-A645-C429D6E02491,2014-09-12 11:15:07.263
2,3,NaN,642.0,4,AW00000003,130774B1-DB21-4EF3-98C8-C104BCD6ED6D,2014-09-12 11:15:07.263
3,4,NaN,932.0,4,AW00000004,FF862851-1DAA-4044-BE7C-3E85583C054D,2014-09-12 11:15:07.263
4,5,NaN,1026.0,4,AW00000005,83905BDC-6F5E-4F71-B162-C98DA069F38A,2014-09-12 11:15:07.263
...,...,...,...,...,...,...,...
19815,30114,1985.0,1986.0,7,AW00030114,97154F3D-28F1-4B15-AE03-9518B781ECE3,2014-09-12 11:15:07.263
19816,30115,1987.0,1988.0,6,AW00030115,E4CF8FD5-30A4-4B8E-8FD8-47032E255778,2014-09-12 11:15:07.263
19817,30116,1989.0,1990.0,4,AW00030116,EC409609-D25D-41B8-9D15-A1AA6E89FC77,2014-09-12 11:15:07.263
19818,30117,1991.0,1992.0,4,AW00030117,6F08E2FB-1CD3-4F6E-A2E6-385669598B19,2014-09-12 11:15:07.263
19819,30118,1993.0,1994.0,3,AW00030118,2495B4EB-FE8B-459E-A1B6-DBA25C04E626,2014-09-12 11:15:07.263

In [82]:
query1= '''select schema_name(t.schema_id) as schema_name,
        t.name as table_name
        from sys.tables t'''
df1= pd.read_sql(query1, src_conn)
df1

   schema_name               table_name
0        Sales             SalesTaxRate
1        Sales         PersonCreditCard
2       Person              PersonPhone
3        Sales           SalesTerritory
4       Person          PhoneNumberType
..         ...                      ...
66  Production                 Location
67      Person                 Password
68       Sales  SalesPersonQuotaHistory
69      Person                   Person
70       Sales              SalesReason

[71 rows x 2 columns]

In [84]:
engine= create_engine(f'postgresql://{user}:{pwd}@localhost:5432/AdventureWorks2022')

In [85]:
sales_df.drop('AccountNumber', axis=1, inplace=True)

In [86]:
sales_df

,CustomerID,PersonID,StoreID,TerritoryID,rowguid,ModifiedDate
0,1,NaN,934.0,1,3F5AE95E-B87D-4AED-95B4-C3797AFCB74F,2014-09-12 11:15:07.263
1,2,NaN,1028.0,1,E552F657-A9AF-4A7D-A645-C429D6E02491,2014-09-12 11:15:07.263
2,3,NaN,642.0,4,130774B1-DB21-4EF3-98C8-C104BCD6ED6D,2014-09-12 11:15:07.263
3,4,NaN,932.0,4,FF862851-1DAA-4044-BE7C-3E85583C054D,2014-09-12 11:15:07.263
4,5,NaN,1026.0,4,83905BDC-6F5E-4F71-B162-C98DA069F38A,2014-09-12 11:15:07.263
...,...,...,...,...,...,...
19815,30114,1985.0,1986.0,7,97154F3D-28F1-4B15-AE03-9518B781ECE3,2014-09-12 11:15:07.263
19816,30115,1987.0,1988.0,6,E4CF8FD5-30A4-4B8E-8FD8-47032E255778,2014-09-12 11:15:07.263
19817,30116,1989.0,1990.0,4,EC409609-D25D-41B8-9D15-A1AA6E89FC77,2014-09-12 11:15:07.263
19818,30117,1991.0,1992.0,4,6F08E2FB-1CD3-4F6E-A2E6-385669598B19,2014-09-12 11:15:07.263
19819,30118,1993.0,1994.0,3,2495B4EB-FE8B-459E-A1B6-DBA25C04E626,2014-09-12 11:15:07.263

In [87]:
sales_df.to_sql(f'stg.{'Sales.Customer_transformed'}', engine, if_exists= 'replace', index=False)

820

In [90]:
list1= ['Sales.SalesTaxRate',
'Sales.PersonCreditCard',
'Person.PersonPhone',
'Sales.SalesTerritory',
'Person.PhoneNumberType',
'Production.Product']

In [91]:
for schema, name in zip(df1['schema_name'], df1['table_name']):
    table= schema+'.'+name
    if table in list1:
        df= pd.read_sql(f"select * from {table}", src_conn)
        df.to_sql(f'stg.{table}', engine, if_exists= 'replace', index=False)